abbbe/tic/sdkconfig.defaults
# Target ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# CPU frequency 240 MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Enable FreeRTOS timer service
CONFIG_FREERTOS_USE_TRACE_FACILITY=y

# TIC Configuration - default to loopback test mode
CONFIG_TIC_LOOPBACK_TEST_MODE=y
CONFIG_TIC_INPUT_GPIO_A=4
CONFIG_TIC_TEST_FREQ_HZ=1000
